package student_oksana_tarasova.lesson_8.level_1;

class DefaultConstructorV3Demo {
    public static void main(String[] args) {
        DefaultConstructorV3 demo = new DefaultConstructorV3();
        System.out.println(demo.getFullName());
        System.out.println(demo.getFemale());
        System.out.println(demo.getIsMale());
        System.out.println(demo.getAge());
    }
}
   /* Создайте класс DefaultConstructorV3Demo, в котором
        внутри main() метода продемонстрируйте ответ на поставленный
        в начале задания вопрос. Для этого после вызова дефолтного
        конструктора и создания инстанции класса DefaultConstructorV3
        распечатайте на экран значения каждого свойства созданой
        инстанции в отдельной строке. Для получения значения свойств
        воспользуйтесь соответствующими get() методами.

    */