/*
Дан код, нужно сделать этот код запускаемым.
Для сдачи работы создайте исправленный класс.

class LoginService {

	public void main(String[] args) {
		System.out.println("You can login!");
	}


}

 */

package student_vlad_behman.lesson_2.level_2;

public class LoginService {
    public static void main(String[] args) {
        System.out.println("You can login!");
    }
}
