/*
Учимся работать со строками.

Тема: создание переменной типа String.

Напишите программу в которой создайте переменную
типа String и присвойте ей в качестве начального значения
ваше имя. Выведете на консоль значение этой переменной.

Пример кода:

    String myName = "Viktor";
    System.out.println(myName);

 */

package student_vlad_behman.lesson_3.level_2;

public class Task_7 {
    public static void main(String[] args) {

        String myName = "VLADI";
        System.out.println(myName);
    }
}
