package student_natalija_rasponomarjova.lesson_2.level_2_intern;
/* Дан код, нужно сделать этот код запускаемым.
Для сдачи работы создайте исправленный класс. */

public class Task_7 {
    public static void main(String[] args) {
        System.out.println("You can login!");
    }
}
