package student_natalija_rasponomarjova.lesson_4.level_7;
/*Создать класс для тестов LeapYearTest
и покрыть тестами весь функционал класса LeapYear.*/
class LeapYearTest {

    public static void main(String[] args) {
        LeapYear leapYear = new LeapYear();
        System.out.println(leapYear.isLeapYear(2023));
    }
}
